stress.yml
config:
  target: 'http://127.0.0.1:2999'
  phases:
    - duration: 100
      arrivalRate: 200
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - loop:
      - get:
          url: "/api/searchListings/{{ $randomNumber(1,1000000) }}"
          count: 5