stress.yml
config:
  target: 'http://127.0.0.1:2999'
  # http:
  #   pool: 2
  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 100
    - duration: 240
      arrivalRate: 150
    - duration: 30
      arrivalRate: 1000
      rampTo: 5
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - loop:
      - get:
          url: "/api/searchListings/{{ $randomNumber(1,10000000) }}"
          count: 100